Revit 2027 API
FamilyManager.DeleteCurrentType Method
Remove the current family type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteCurrentType()
Public Sub DeleteCurrentType
public:
void DeleteCurrentType()
member DeleteCurrentType : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when there is only one family type in current document.
Remarks
If successfully removed, the first available type will become the current type, otherwise an exception with failure information will be thrown.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace